# 3) Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.
m = int(input("введите номер месяца"))
#if m>3 and m<6:
#    print("весна")
#elif m>5 and m<9:
#    print("лето")
#elif m>8 and m<12:
#    print("осень")
#else:  print("зима")


months_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна",
               6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень",
               11: "осень", 12: "зима"}
value = months_dict[m]

print(f" это {value}")
